Repository: thomas-domville/AppleVis
Catalog: AppleVis/Sources/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, el, es, fa, fr, he, hi, id, it, ja, ko, nl, pl, pt, ru, sv, th, tr, uk, vi, zh_hans

source: Editing a Forum Topic, Guide comment, App Entry review, App Entry, Blog Post, Guide, Bug Report, or Podcast Episode used to pre-fill the edit box with the rendered HTML behind the content — literal <p> and <a href="..."> tags — instead of the original text. Saving without cleaning that out could also silently corrupt the formatting, since the edit always saved as Plain Text regardless of the content's real format (Markdown, for many longer posts). Both fixed: editing now starts from the original source text, and saves preserve whichever format the content actually uses. Found while looking into a report of stray HTML showing up while editing a topic.
ar: كان تعديل موضوع منتدى أو تعليق على دليل أو مراجعة لإدخال تطبيق أو إدخال تطبيق أو منشور مدونة أو دليل أو تقرير خطأ أو حلقة بودكاست يملأ مربع التعديل مسبقًا بشفرة HTML الناتجة خلف المحتوى — وسوم <p> و<a href="..."> حرفيًا — بدلًا من النص الأصلي. وكان الحفظ دون تنظيف ذلك قد يُفسد التنسيق بصمت أيضًا، لأن التعديل كان يُحفظ دائمًا كنص عادي بغض النظر عن التنسيق الفعلي للمحتوى (Markdown في كثير من المنشورات الأطول). أُصلح الأمران: يبدأ التعديل الآن من النص المصدري الأصلي، ويحافظ الحفظ على التنسيق الذي يستخدمه المحتوى فعلًا. اكتُشف ذلك أثناء فحص بلاغ عن ظهور HTML عشوائي أثناء تعديل موضوع.
de: Beim Bearbeiten eines Forenthemas, eines Kommentars zu einer Anleitung, einer App-Rezension, eines App-Eintrags, Blogbeitrags, einer Anleitung, eines Fehlerberichts oder einer Podcast-Folge wurde das Bearbeitungsfeld mit dem gerenderten HTML hinter dem Inhalt vorausgefüllt – wörtliche <p>- und <a href="...">-Tags – statt mit dem Originaltext. Wer das beim Speichern nicht bereinigte, konnte außerdem unbemerkt die Formatierung beschädigen, da die Änderung immer als reiner Text gespeichert wurde, unabhängig vom tatsächlichen Format des Inhalts (bei vielen längeren Beiträgen Markdown). Beides behoben: Das Bearbeiten beginnt jetzt mit dem ursprünglichen Quelltext, und beim Speichern bleibt das tatsächlich verwendete Format erhalten. Entdeckt bei der Untersuchung einer Meldung über HTML-Reste beim Bearbeiten eines Themas.
el: Η επεξεργασία ενός θέματος του φόρουμ, σχολίου σε οδηγό, κριτικής καταχώρισης εφαρμογής, καταχώρισης εφαρμογής, ανάρτησης ιστολογίου, οδηγού, αναφοράς σφάλματος ή επεισοδίου podcast συμπλήρωνε το πλαίσιο επεξεργασίας με το αποδοσμένο HTML πίσω από το περιεχόμενο — κυριολεκτικές ετικέτες <p> και <a href="..."> — αντί για το αρχικό κείμενο. Η αποθήκευση χωρίς να τις καθαρίσετε μπορούσε επίσης να αλλοιώσει σιωπηλά τη μορφοποίηση, αφού η επεξεργασία αποθηκευόταν πάντα ως Απλό κείμενο ανεξάρτητα από την πραγματική μορφή του περιεχομένου (Markdown, για πολλές μεγαλύτερες αναρτήσεις). Διορθώθηκαν και τα δύο: η επεξεργασία ξεκινά πλέον από το αρχικό κείμενο προέλευσης και η αποθήκευση διατηρεί όποια μορφή χρησιμοποιεί πραγματικά το περιεχόμενο. Εντοπίστηκε κατά τη διερεύνηση μιας αναφοράς για άσχετο HTML που εμφανιζόταν κατά την επεξεργασία ενός θέματος.
es: Al editar un tema del foro, un comentario de una guía, una reseña de una entrada de app, una entrada de app, una entrada de blog, una guía, un informe de error o un episodio de pódcast, el cuadro de edición se rellenaba con el HTML renderizado detrás del contenido (etiquetas <p> y <a href="..."> literales) en lugar del texto original. Guardar sin limpiarlo también podía estropear el formato sin avisar, porque la edición se guardaba siempre como Texto sin formato, fuera cual fuera el formato real del contenido (Markdown, en muchas publicaciones largas). Ambas cosas corregidas: la edición ahora parte del texto original, y al guardar se conserva el formato que realmente usa el contenido. Se descubrió al investigar un informe de HTML suelto que aparecía al editar un tema.
fa: ویرایش یک موضوع انجمن، نظرِ یک راهنما، نقدِ یک ورودی برنامه، ورودی برنامه، پست وبلاگ، راهنما، گزارش اشکال یا قسمت پادکست، کادر ویرایش را به‌جای متن اصلی با HTML پردازش‌شدهٔ پشت محتوا پر می‌کرد — یعنی خودِ برچسب‌های <p> و <a href="...">. ذخیره بدون پاک کردن آن‌ها هم ممکن بود بی‌صدا قالب‌بندی را خراب کند، چون ویرایش همیشه به‌صورت متن ساده ذخیره می‌شد، صرف‌نظر از قالب واقعی محتوا (در بسیاری از پست‌های بلندتر Markdown). هر دو رفع شد: ویرایش اکنون از متن منبع اصلی شروع می‌شود و ذخیره، قالبی را که محتوا واقعاً استفاده می‌کند حفظ می‌کند. هنگام بررسی گزارشی دربارهٔ ظاهر شدن HTML اضافی در ویرایش یک موضوع پیدا شد.
fr: Modifier un sujet du forum, un commentaire de guide, un avis sur une fiche d'appli, une fiche d'appli, un article de blog, un guide, un rapport de bug ou un épisode de podcast préremplissait la zone de modification avec le HTML rendu derrière le contenu — des balises <p> et <a href="..."> littérales — au lieu du texte d'origine. Enregistrer sans les nettoyer pouvait aussi abîmer discrètement la mise en forme, car la modification était toujours enregistrée en texte brut, quel que soit le format réel du contenu (Markdown pour de nombreuses publications longues). Les deux sont corrigés : la modification part désormais du texte source d'origine, et l'enregistrement conserve le format réellement utilisé par le contenu. Découvert en examinant un signalement de HTML parasite lors de la modification d'un sujet.
he: עריכת נושא בפורום, תגובה למדריך, ביקורת על רשומת אפליקציה, רשומת אפליקציה, פוסט בבלוג, מדריך, דיווח באג או פרק פודקאסט מילאה מראש את תיבת העריכה ב-HTML המעובד שמאחורי התוכן — תגיות <p> ו-<a href="..."> ממש — במקום בטקסט המקורי. שמירה בלי לנקות אותן עלולה הייתה גם לשבש את העיצוב בשקט, כי העריכה נשמרה תמיד כטקסט רגיל ללא קשר לפורמט האמיתי של התוכן (Markdown בהרבה פוסטים ארוכים). שתי הבעיות תוקנו: העריכה מתחילה עכשיו מטקסט המקור, והשמירה משמרת את הפורמט שבו התוכן באמת משתמש. התגלה במהלך בדיקת דיווח על HTML מיותר שהופיע בעריכת נושא.
hi: किसी फ़ोरम विषय, गाइड टिप्पणी, ऐप प्रविष्टि समीक्षा, ऐप प्रविष्टि, ब्लॉग पोस्ट, गाइड, बग रिपोर्ट या पॉडकास्ट एपिसोड को संपादित करने पर संपादन बॉक्स में मूल टेक्स्ट की जगह सामग्री के पीछे का रेंडर किया हुआ HTML पहले से भर जाता था — सीधे <p> और <a href="..."> टैग। उसे साफ़ किए बिना सहेजने से फ़ॉर्मैटिंग भी चुपचाप बिगड़ सकती थी, क्योंकि संपादन हमेशा सादे टेक्स्ट के रूप में सहेजा जाता था, भले ही सामग्री का असली फ़ॉर्मैट कुछ भी हो (कई लंबी पोस्ट के लिए Markdown)। दोनों ठीक कर दिए गए हैं: संपादन अब मूल स्रोत टेक्स्ट से शुरू होता है, और सहेजते समय सामग्री का असली फ़ॉर्मैट बना रहता है। किसी विषय को संपादित करते समय अनचाहा HTML दिखने की रिपोर्ट की जाँच के दौरान मिला।
id: Mengedit topik forum, komentar panduan, ulasan entri aplikasi, entri aplikasi, postingan blog, panduan, laporan bug, atau episode podcast dulu mengisi kotak edit dengan HTML hasil render di balik konten — tag <p> dan <a href="..."> apa adanya — alih-alih teks aslinya. Menyimpan tanpa membersihkannya juga bisa diam-diam merusak format, karena suntingan selalu disimpan sebagai Teks Biasa apa pun format sebenarnya (Markdown, untuk banyak postingan panjang). Keduanya diperbaiki: pengeditan kini dimulai dari teks sumber asli, dan penyimpanan mempertahankan format yang benar-benar digunakan konten. Ditemukan saat menyelidiki laporan HTML nyasar yang muncul saat mengedit topik.
it: Modificare un argomento del forum, un commento a una guida, una recensione di una voce dell'app, una voce dell'app, un articolo del blog, una guida, una segnalazione di bug o un episodio di podcast precompilava il campo di modifica con l'HTML generato dietro il contenuto (tag <p> e <a href="..."> letterali) invece che con il testo originale. Salvare senza ripulirlo poteva anche rovinare la formattazione senza avvisare, perché la modifica veniva sempre salvata come testo semplice, qualunque fosse il formato reale del contenuto (Markdown, per molti post più lunghi). Entrambi i problemi sono stati risolti: la modifica ora parte dal testo sorgente originale e il salvataggio mantiene il formato effettivamente usato dal contenuto. Scoperto analizzando una segnalazione di HTML indesiderato durante la modifica di un argomento.
ja: フォーラムのトピック、ガイドへのコメント、アプリのエントリへのレビュー、アプリのエントリ、ブログ記事、ガイド、バグレポート、ポッドキャストのエピソードを編集すると、元のテキストではなく、内容の裏にある HTML（<p> や <a href="..."> タグそのもの）が編集欄に入っていました。これを消さずに保存すると、内容の実際の形式（長めの投稿の多くは Markdown）にかかわらず常にプレーンテキストとして保存されるため、書式が知らないうちに崩れることもありました。どちらも修正しました。編集は元のテキストから始まり、保存時にも実際の形式が保たれます。トピック編集中に余計な HTML が表示されるという報告を調べる中で見つかった問題です。
ko: 포럼 주제, 가이드 댓글, 앱 항목 리뷰, 앱 항목, 블로그 게시물, 가이드, 버그 리포트, 팟캐스트 에피소드를 편집하면 원래 텍스트 대신 콘텐츠 뒤에 있는 렌더링된 HTML, 즉 <p>와 <a href="..."> 태그가 그대로 편집 상자에 채워졌습니다. 이를 지우지 않고 저장하면 콘텐츠의 실제 형식(긴 게시물은 대부분 Markdown)과 상관없이 항상 일반 텍스트로 저장되어 서식이 조용히 깨질 수도 있었습니다. 둘 다 수정했습니다. 이제 편집은 원본 텍스트에서 시작하고, 저장할 때 콘텐츠가 실제로 사용하는 형식이 유지됩니다. 주제를 편집할 때 불필요한 HTML이 나타난다는 제보를 살펴보다가 발견했습니다.
nl: Bij het bewerken van een forumonderwerp, een reactie op een handleiding, een recensie van een app-vermelding, een app-vermelding, blogbericht, handleiding, bugmelding of podcastaflevering werd het bewerkingsvak vooraf gevuld met de weergegeven HTML achter de inhoud — letterlijke <p>- en <a href="...">-tags — in plaats van de oorspronkelijke tekst. Opslaan zonder dat op te schonen kon ook ongemerkt de opmaak beschadigen, omdat de bewerking altijd als platte tekst werd opgeslagen, ongeacht de werkelijke opmaak van de inhoud (Markdown bij veel langere berichten). Beide opgelost: bewerken begint nu vanaf de oorspronkelijke brontekst, en bij opslaan blijft de opmaak behouden die de inhoud echt gebruikt. Ontdekt tijdens het onderzoeken van een melding over losse HTML bij het bewerken van een onderwerp.
pl: Edytowanie tematu na forum, komentarza do poradnika, recenzji wpisu aplikacji, wpisu aplikacji, wpisu na blogu, poradnika, zgłoszenia błędu lub odcinka podcastu wstawiało do pola edycji wyrenderowany HTML stojący za treścią — dosłowne znaczniki <p> i <a href="..."> — zamiast oryginalnego tekstu. Zapisanie bez ich usunięcia mogło też po cichu zepsuć formatowanie, ponieważ zmiana zawsze zapisywała się jako zwykły tekst, niezależnie od faktycznego formatu treści (w wielu dłuższych wpisach Markdown). Oba problemy naprawione: edycja zaczyna się teraz od oryginalnego tekstu źródłowego, a zapis zachowuje format, którego treść faktycznie używa. Wykryte podczas sprawdzania zgłoszenia o zbędnym HTML pojawiającym się przy edycji tematu.
pt: Editar um tópico do fórum, um comentário de guia, uma avaliação de entrada de app, uma entrada de app, uma postagem do blog, um guia, um relatório de bug ou um episódio de podcast preenchia a caixa de edição com o HTML renderizado por trás do conteúdo — tags <p> e <a href="..."> literais — em vez do texto original. Salvar sem limpar isso também podia estragar a formatação sem aviso, já que a edição sempre era salva como texto simples, independentemente do formato real do conteúdo (Markdown, em muitas publicações longas). As duas coisas foram corrigidas: a edição agora começa pelo texto original, e o salvamento preserva o formato que o conteúdo realmente usa. Descoberto ao investigar um relato de HTML solto aparecendo ao editar um tópico.
ru: При редактировании темы форума, комментария к руководству, отзыва о приложении, записи приложения, записи блога, руководства, отчёта об ошибке или выпуска подкаста поле редактирования заполнялось готовым HTML-кодом содержимого — буквальными тегами <p> и <a href="..."> — вместо исходного текста. Сохранение без их удаления могло к тому же незаметно испортить форматирование, поскольку правка всегда сохранялась как обычный текст, каким бы ни был настоящий формат содержимого (у многих длинных записей — Markdown). Исправлено и то и другое: редактирование теперь начинается с исходного текста, а при сохранении сохраняется формат, который на самом деле использует содержимое. Обнаружено при разборе сообщения о лишнем HTML при редактировании темы.
sv: När du redigerade ett forumämne, en kommentar till en guide, en recension av ett appobjekt, ett appobjekt, ett blogginlägg, en guide, en felrapport eller ett poddavsnitt fylldes redigeringsrutan i förväg med den renderade HTML-koden bakom innehållet – bokstavliga <p>- och <a href="...">-taggar – i stället för originaltexten. Att spara utan att rensa bort det kunde också tyst förstöra formateringen, eftersom ändringen alltid sparades som ren text oavsett innehållets verkliga format (Markdown för många längre inlägg). Båda åtgärdade: redigering utgår nu från den ursprungliga källtexten, och när du sparar behålls det format innehållet faktiskt använder. Upptäckt vid utredningen av en rapport om lösryckt HTML vid redigering av ett ämne.
th: การแก้ไขหัวข้อฟอรัม ความคิดเห็นในคู่มือ รีวิวรายการแอป รายการแอป บทความบล็อก คู่มือ รายงานข้อบกพร่อง หรือตอนพอดแคสต์ เคยเติม HTML ที่เรนเดอร์แล้วซึ่งอยู่เบื้องหลังเนื้อหาลงในช่องแก้ไข — แท็ก <p> และ <a href="..."> ตรง ๆ — แทนข้อความต้นฉบับ การบันทึกโดยไม่ลบสิ่งเหล่านั้นออกยังอาจทำให้รูปแบบเสียหายโดยไม่รู้ตัว เพราะการแก้ไขจะถูกบันทึกเป็นข้อความธรรมดาเสมอ ไม่ว่ารูปแบบจริงของเนื้อหาจะเป็นอะไร (Markdown สำหรับโพสต์ยาวจำนวนมาก) แก้ไขทั้งสองอย่างแล้ว: การแก้ไขจะเริ่มจากข้อความต้นฉบับ และการบันทึกจะคงรูปแบบที่เนื้อหาใช้จริงไว้ พบขณะตรวจสอบรายงานเรื่อง HTML แปลกปลอมที่โผล่ขึ้นมาระหว่างแก้ไขหัวข้อ
tr: Bir forum konusunu, kılavuz yorumunu, uygulama girişi incelemesini, uygulama girişini, blog yazısını, kılavuzu, hata raporunu veya podcast bölümünü düzenlemek, düzenleme kutusunu özgün metin yerine içeriğin arkasındaki işlenmiş HTML ile — birebir <p> ve <a href="..."> etiketleriyle — dolduruyordu. Bunları temizlemeden kaydetmek biçimlendirmeyi de sessizce bozabiliyordu, çünkü düzenleme, içeriğin gerçek biçiminden bağımsız olarak (daha uzun gönderilerin çoğunda Markdown) her zaman Düz Metin olarak kaydediliyordu. İkisi de düzeltildi: düzenleme artık özgün kaynak metinden başlıyor ve kaydetme, içeriğin gerçekte kullandığı biçimi koruyor. Bir konu düzenlenirken beliren gereksiz HTML ile ilgili bir bildirim incelenirken bulundu.
uk: Під час редагування теми форуму, коментаря до посібника, відгуку на запис додатка, запису додатка, запису блогу, посібника, звіту про помилку чи випуску подкасту поле редагування заповнювалося готовим HTML-кодом вмісту — буквальними тегами <p> і <a href="..."> — замість оригінального тексту. Збереження без їх видалення могло ще й непомітно зіпсувати форматування, бо правка завжди зберігалася як звичайний текст, хоч який насправді формат мав вміст (у багатьох довгих дописах — Markdown). Виправлено обидві проблеми: редагування тепер починається з оригінального тексту, а під час збереження залишається формат, який справді використовує вміст. Виявлено під час розгляду повідомлення про зайвий HTML під час редагування теми.
vi: Khi chỉnh sửa một chủ đề diễn đàn, bình luận hướng dẫn, đánh giá mục ứng dụng, mục ứng dụng, bài viết blog, hướng dẫn, báo cáo lỗi hoặc tập podcast, ô chỉnh sửa từng được điền sẵn mã HTML đã kết xuất đằng sau nội dung — nguyên các thẻ <p> và <a href="..."> — thay vì văn bản gốc. Lưu mà không dọn sạch còn có thể âm thầm làm hỏng định dạng, vì bản chỉnh sửa luôn được lưu dưới dạng Văn bản thuần bất kể định dạng thật của nội dung (Markdown, với nhiều bài dài). Cả hai đã được sửa: chỉnh sửa giờ bắt đầu từ văn bản nguồn gốc, và khi lưu sẽ giữ đúng định dạng mà nội dung thực sự dùng. Phát hiện khi xem xét một báo cáo về HTML lạ xuất hiện lúc chỉnh sửa chủ đề.
zh_hans: 编辑论坛话题、指南评论、应用条目评测、应用条目、博客文章、指南、错误报告或播客单集时，编辑框里预先填入的是内容背后渲染出的 HTML——也就是原样的 <p> 和 <a href="..."> 标签——而不是原始文字。如果不清理就保存，还可能悄悄破坏格式，因为无论内容实际使用哪种格式（许多较长帖子使用 Markdown），编辑都会被保存为纯文本。两个问题都已修复：编辑现在从原始文本开始，保存时也会保留内容实际使用的格式。这是在调查“编辑话题时出现多余 HTML”的报告时发现的。

source: Every Wizard Now Matches the Welcome Tour's Step Format
ar: كل المعالجات تتبع الآن نمط خطوات الجولة الترحيبية
de: Jeder Assistent folgt jetzt dem Schrittformat der Willkommenstour
el: Κάθε οδηγός ακολουθεί πλέον τη μορφή βημάτων της Περιήγησης Καλωσορίσματος
es: Todos los asistentes siguen ahora el formato de pasos del recorrido de bienvenida
fa: همهٔ راهنماهای گام‌به‌گام اکنون از قالب مراحل تور خوش‌آمدگویی پیروی می‌کنند
fr: Tous les assistants suivent désormais le format d'étapes de la visite de bienvenue
he: כל אשף תואם עכשיו לתבנית השלבים של סיור הפתיחה
hi: हर विज़ार्ड अब वेलकम टूर के चरण प्रारूप से मेल खाता है
id: Setiap Wizard Kini Mengikuti Format Langkah Tur Sambutan
it: Ogni procedura guidata ora segue il formato a passaggi del tour di benvenuto
ja: すべてのウィザードがウェルカムツアーのステップ形式に統一
ko: 모든 마법사가 이제 환영 투어의 단계 형식을 따릅니다
nl: Elke wizard volgt nu de stapindeling van de welkomstrondleiding
pl: Każdy kreator ma teraz układ kroków taki jak w samouczku powitalnym
pt: Todos os assistentes agora seguem o formato de etapas do tour de boas-vindas
ru: Все мастера теперь используют формат шагов из приветственного тура
sv: Varje guide följer nu välkomstturens stegformat
th: ตัวช่วยทุกตัวใช้รูปแบบขั้นตอนเดียวกับทัวร์ต้อนรับแล้ว
tr: Tüm Sihirbazlar Artık Karşılama Turunun Adım Biçimine Uyuyor
uk: Усі майстри тепер мають формат кроків як у вітальному турі
vi: Mọi trình hướng dẫn giờ theo định dạng bước của chuyến tham quan chào mừng
zh_hans: 所有向导现在都采用欢迎导览的步骤格式
